In [3]:
import pandas as pd
import numpy as np

## NaN´s

In [4]:
data = {
    'Nome':['Teo', 'Maria', 'Lara', 'Nath', 'Ste'],
    'Idade':[32,22,56,21,np.nan],
    'Renda':[np.nan, 3456, 2500, 5500, np.nan]
}

df = pd.DataFrame(data)

In [5]:
df

    Nome  Idade   Renda
0    Teo   32.0     NaN
1  Maria   22.0  3456.0
2   Lara   56.0  2500.0
3   Nath   21.0  5500.0
4    Ste    NaN     NaN

In [6]:
df['Renda'].isna()

0     True
1    False
2    False
3    False
4     True
Name: Renda, dtype: bool

In [7]:
df['Renda'].isna().sum()

np.int64(2)

In [9]:
df.isna().sum()

Nome     0
Idade    1
Renda    2
dtype: int64

In [ ]:
df.isna().mean() #proporção de NAN por coluna

Nome     0.0
Idade    0.2
Renda    0.4
dtype: float64

In [12]:
df.fillna({"Idade": df['Idade'].mean(),
           "Renda":df['Renda'].mean()})

    Nome  Idade        Renda
0    Teo  32.00  3818.666667
1  Maria  22.00  3456.000000
2   Lara  56.00  2500.000000
3   Nath  21.00  5500.000000
4    Ste  32.75  3818.666667

In [13]:
df.dropna()

    Nome  Idade   Renda
1  Maria   22.0  3456.0
2   Lara   56.0  2500.0
3   Nath   21.0  5500.0

In [15]:
df.dropna(subset=['Idade','Renda'], how="all")

    Nome  Idade   Renda
0    Teo   32.0     NaN
1  Maria   22.0  3456.0
2   Lara   56.0  2500.0
3   Nath   21.0  5500.0

In [16]:
df.dropna(subset=['Idade','Renda'], how="any")

    Nome  Idade   Renda
1  Maria   22.0  3456.0
2   Lara   56.0  2500.0
3   Nath   21.0  5500.0

In [17]:
df.dropna(axis=1)

    Nome
0    Teo
1  Maria
2   Lara
3   Nath
4    Ste